sulaolab/dspic33ak-usart-cmsis-driver/src/hal_uart/dspic33ak_uart.c
/* ========================================================================== */
/* Includes                                                                   */
/* ========================================================================== */

#include <xc.h>          /* TX interrupt Flag/Enable/Priority bits (async TX) */
#include <string.h>

#include "dspic33ak_uart.h"
#include "dspic33ak_uart_rx_isr_ring.h"
#include "dspic33ak_uart_device.h"
#include "dspic33ak_uart_reg.h"

/* ========================================================================== */
/* Module Variables                                                           */
/* ========================================================================== */

static uint32_t g_timeout_ms[DSPIC33AK_UART_INST_COUNT];
static dspic33ak_uart_get_ms_fn g_get_ms[DSPIC33AK_UART_INST_COUNT];
static bool g_initialized[DSPIC33AK_UART_INST_COUNT];

/* Per-instance RX backend (defaults to polling; set from config at init). The
 * RX query/read/flush API consults this to pick the FIFO or the ISR ring. */
static dspic33ak_uart_rx_mode_t g_rx_mode[DSPIC33AK_UART_INST_COUNT];

/* ---- Asynchronous transfer model state (per instance) -------------------- *
 * All of this is inert until dspic33ak_uart_tx_start()/_rx_start() is used, so
 * it does not affect the byte-stream API or the RX ISR ring.
 *
 * Sharing with interrupt context: the TX ISR updates g_tx_count/g_tx_busy and
 * the RX ISR updates g_rx_count/g_rx_busy, so only those counters and flags are
 * volatile. The buffer pointer and length are written once (before the busy
 * flag is set and the interrupt is enabled) and only read afterwards, so they
 * do not need to be volatile. */
static dspic33ak_uart_event_callback_t g_callback[DSPIC33AK_UART_INST_COUNT];
static void *g_callback_user_data[DSPIC33AK_UART_INST_COUNT];

static uint32_t g_uart_clk_hz[DSPIC33AK_UART_INST_COUNT];
static uint32_t g_baudrate[DSPIC33AK_UART_INST_COUNT];
static bool     g_tx_enabled[DSPIC33AK_UART_INST_COUNT];
static bool     g_rx_enabled[DSPIC33AK_UART_INST_COUNT];
static uint8_t  g_tx_irq_priority[DSPIC33AK_UART_INST_COUNT];

static const uint8_t   *g_tx_buf[DSPIC33AK_UART_INST_COUNT];
static size_t           g_tx_len[DSPIC33AK_UART_INST_COUNT];
static volatile size_t  g_tx_count[DSPIC33AK_UART_INST_COUNT];
static volatile bool    g_tx_busy[DSPIC33AK_UART_INST_COUNT];

static uint8_t         *g_rx_buf[DSPIC33AK_UART_INST_COUNT];
static size_t           g_rx_len[DSPIC33AK_UART_INST_COUNT];
static volatile size_t  g_rx_count[DSPIC33AK_UART_INST_COUNT];
static volatile bool    g_rx_busy[DSPIC33AK_UART_INST_COUNT];

/* ========================================================================== */
/* Local Function Prototypes                                                  */
/* ========================================================================== */

static bool uart_inst_is_valid(dspic33ak_uart_instance_t inst);
static dspic33ak_uart_status_t uart_get_regs(
    dspic33ak_uart_instance_t inst,
    const dspic33ak_uart_regs_t **regs);
static dspic33ak_uart_status_t uart_require_initialized(
    dspic33ak_uart_instance_t inst,
    const dspic33ak_uart_regs_t **regs);
static dspic33ak_uart_status_t uart_check_initialized(
    dspic33ak_uart_instance_t inst);
static uint32_t uart_calc_brg(
    uint32_t uart_clk_hz,
    uint32_t baudrate);
static bool uart_timeout_enabled(
    dspic33ak_uart_instance_t inst);
static uint32_t uart_timeout_start_ms(
    dspic33ak_uart_instance_t inst);
static bool uart_timeout_expired(
    dspic33ak_uart_instance_t inst,
    uint32_t start_ms);

static void uart_async_reset(dspic33ak_uart_instance_t inst);
static void uart_notify(dspic33ak_uart_instance_t inst, uint32_t events);

static bool uart_tx_irq_set_priority(dspic33ak_uart_instance_t inst, uint8_t prio);
static bool uart_tx_irq_clear_flag(dspic33ak_uart_instance_t inst);
static bool uart_tx_irq_raise_flag(dspic33ak_uart_instance_t inst);
static bool uart_tx_irq_enable(dspic33ak_uart_instance_t inst, bool enable);

/* ========================================================================== */
/* Public Functions                                                           */
/* ========================================================================== */

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_init                                                        */
/* -------------------------------------------------------------------------- */
dspic33ak_uart_status_t dspic33ak_uart_init(
    dspic33ak_uart_instance_t inst,
    const dspic33ak_uart_config_t *config)
{
    const dspic33ak_uart_regs_t *r;
    dspic33ak_uart_status_t st;
    uint32_t brg;

    if (!uart_inst_is_valid(inst)) {
        return DSPIC33AK_UART_ERR_INVALID_ARG;
    }

    if (config == 0 || config->uart_clk_hz == 0u || config->baudrate == 0u) {
        return DSPIC33AK_UART_ERR_INVALID_ARG;
    }

    /* Current implementation supports 8N1 (UxCON MODE=0 reset default). */
    if (config->data_bits != 8u ||
        config->stop_bits != 1u ||
        config->parity != DSPIC33AK_UART_PARITY_NONE) {
        return DSPIC33AK_UART_ERR_UNSUPPORTED;
    }

    /* RX backend must be a known mode. Reject unknown/uninitialized rx_mode here,
     * before touching any register, so a bad config never silently falls through
     * to polling and never leaves the UART peripheral half-configured. */
    if ((config->rx_mode != DSPIC33AK_UART_RX_MODE_POLLING) &&
        (config->rx_mode != DSPIC33AK_UART_RX_MODE_ISR_RING)) {
        return DSPIC33AK_UART_ERR_INVALID_ARG;
    }

    st = uart_get_regs(inst, &r);
    if (st != DSPIC33AK_UART_OK) {
        return st;
    }

    brg = uart_calc_brg(config->uart_clk_hz, config->baudrate);
    if (brg == 0u) {
        return DSPIC33AK_UART_ERR_INVALID_ARG;
    }

    /* Turn the module off and start from a known 8N1 state. */
    *r->CON = 0u;
    *r->STAT = 0u;

    /* Clock: select CLKGEN8 (CLKSEL) and fractional baud mode (CLKMOD; BRGS stays
     * 0). This HAL assumes CLKGEN8 as the UART clock source; the board/application
     * must have brought CLKGEN8 up before init, and config.uart_clk_hz must be the
     * CLKGEN8 frequency used for the baud-divisor calculation. */
    dspic33ak_uart_reg_set(r->CON, DSPIC33AK_UART_CON_CLKSEL);
    dspic33ak_uart_reg_set(r->CON, DSPIC33AK_UART_CON_CLKMOD);

    *r->BRG = brg;

    /* TX FIFO write enable. */
    dspic33ak_uart_reg_set(r->STAT, DSPIC33AK_UART_STAT_TXWRE);

