sulaolab/dspic33ak-usart-cmsis-driver/src/hal_uart/dspic33ak_uart.c
    if (config->enable_tx) {
        dspic33ak_uart_reg_set(r->CON, DSPIC33AK_UART_CON_TXEN);
    }
    if (config->enable_rx) {
        dspic33ak_uart_reg_set(r->CON, DSPIC33AK_UART_CON_RXEN);
    }

    /* Enable the module last. */
    dspic33ak_uart_reg_set(r->CON, DSPIC33AK_UART_CON_ON);

    g_timeout_ms[inst] = config->timeout_ms;
    g_get_ms[inst] = config->get_ms;
    g_initialized[inst] = true;
    g_rx_mode[inst] = config->rx_mode;

    /* Async transfer model context: remember clock/baud and the TX/RX enable
     * state, start with a cleared callback and no active transfer, and program
     * the (disabled) TX interrupt priority for the async TX engine. */
    g_uart_clk_hz[inst]     = config->uart_clk_hz;
    g_baudrate[inst]        = config->baudrate;
    g_tx_enabled[inst]      = config->enable_tx;
    g_rx_enabled[inst]      = config->enable_rx;
    g_tx_irq_priority[inst] = config->tx_irq_priority;
    g_callback[inst]           = 0;
    g_callback_user_data[inst] = 0;
    uart_async_reset(inst);

    (void)uart_tx_irq_enable(inst, false);
    (void)uart_tx_irq_clear_flag(inst);
    (void)uart_tx_irq_set_priority(inst, config->tx_irq_priority);

    /*
     * RX backend setup. ISR ring mode configures and enables the interrupt-driven
     * RX ring now. dspic33ak_uart_rx_isr_config() requires the instance to be
     * initialized, so this runs after g_initialized = true. On failure, unwind via
     * deinit so a half-initialized instance is never left behind.
     */
    if (config->rx_mode == DSPIC33AK_UART_RX_MODE_ISR_RING) {
        dspic33ak_uart_rx_isr_config_t rx_cfg;

        rx_cfg.buffer       = config->rx_ring_buffer;
        rx_cfg.buffer_size  = config->rx_ring_buffer_size;
        rx_cfg.irq_priority = config->rx_irq_priority;

        st = dspic33ak_uart_rx_isr_config(inst, &rx_cfg);
        if (st != DSPIC33AK_UART_OK) {
            (void)dspic33ak_uart_deinit(inst);
            return st;
        }

        st = dspic33ak_uart_rx_isr_enable(inst);
        if (st != DSPIC33AK_UART_OK) {
            (void)dspic33ak_uart_deinit(inst);
            return st;
        }
    }

    return DSPIC33AK_UART_OK;
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_deinit                                                      */
/* -------------------------------------------------------------------------- */
dspic33ak_uart_status_t dspic33ak_uart_deinit(
    dspic33ak_uart_instance_t inst)
{
    const dspic33ak_uart_regs_t *r;
    dspic33ak_uart_status_t st;

    if (!uart_inst_is_valid(inst)) {
        return DSPIC33AK_UART_ERR_INVALID_ARG;
    }

    st = uart_get_regs(inst, &r);
    if (st != DSPIC33AK_UART_OK) {
        return st;
    }

    /* Stop the RX ISR first (if this instance ran the ring) so it cannot touch
     * the FIFO mid-teardown. Safe/no-op in polling mode. */
    if (g_rx_mode[inst] == DSPIC33AK_UART_RX_MODE_ISR_RING) {
        (void)dspic33ak_uart_rx_isr_disable(inst);
    }

    /* Stop the async TX engine too (no-op if it was never used). */
    (void)uart_tx_irq_enable(inst, false);
    (void)uart_tx_irq_clear_flag(inst);

    dspic33ak_uart_reg_clear(r->CON,
                             DSPIC33AK_UART_CON_TXEN |
                             DSPIC33AK_UART_CON_RXEN |
                             DSPIC33AK_UART_CON_ON);

    g_timeout_ms[inst] = 0u;
    g_get_ms[inst] = 0;
    g_initialized[inst] = false;
    g_rx_mode[inst] = DSPIC33AK_UART_RX_MODE_POLLING;

    /* Drop async transfer model state. */
    g_uart_clk_hz[inst]        = 0u;
    g_baudrate[inst]           = 0u;
    g_tx_enabled[inst]         = false;
    g_rx_enabled[inst]         = false;
    g_tx_irq_priority[inst]    = 0u;
    g_callback[inst]           = 0;
    g_callback_user_data[inst] = 0;
    uart_async_reset(inst);

    return DSPIC33AK_UART_OK;
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_is_present                                                  */
/* -------------------------------------------------------------------------- */
bool dspic33ak_uart_is_present(dspic33ak_uart_instance_t inst)
{
    return dspic33ak_uart_instance_is_present(inst);
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_is_initialized                                              */
/* -------------------------------------------------------------------------- */
bool dspic33ak_uart_is_initialized(dspic33ak_uart_instance_t inst)
{
    if (!uart_inst_is_valid(inst)) {
        return false;
    }

    return g_initialized[inst];
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_rx_ready                                                    */
/* -------------------------------------------------------------------------- */
bool dspic33ak_uart_rx_ready(dspic33ak_uart_instance_t inst)
{
    const dspic33ak_uart_regs_t *r;

    if (uart_require_initialized(inst, &r) != DSPIC33AK_UART_OK) {
        return false;
    }

    /* ISR ring backend: readiness reflects buffered ring contents. */
    if (g_rx_mode[inst] == DSPIC33AK_UART_RX_MODE_ISR_RING) {
        return dspic33ak_uart_rx_isr_ready(inst);
    }

    /* Polling backend: RX has data when the RX FIFO is NOT empty. */
    return !dspic33ak_uart_reg_is_set(r->STAT, DSPIC33AK_UART_STAT_RXBE);
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_tx_ready                                                    */
/* -------------------------------------------------------------------------- */
bool dspic33ak_uart_tx_ready(dspic33ak_uart_instance_t inst)
{
    const dspic33ak_uart_regs_t *r;

    if (uart_require_initialized(inst, &r) != DSPIC33AK_UART_OK) {
        return false;
    }

    /* TX can accept a byte when the TX buffer is NOT full. */
    return !dspic33ak_uart_reg_is_set(r->STAT, DSPIC33AK_UART_STAT_TXBF);
}

