sulaolab/dspic33ak-usart-cmsis-driver/src/hal_uart/dspic33ak_uart.c
/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_tx_done                                                     */
/* -------------------------------------------------------------------------- */
bool dspic33ak_uart_tx_done(dspic33ak_uart_instance_t inst)
{
    const dspic33ak_uart_regs_t *r;

    if (uart_require_initialized(inst, &r) != DSPIC33AK_UART_OK) {
        return false;
    }

    return dspic33ak_uart_reg_is_set(r->STAT, DSPIC33AK_UART_STAT_TXMTIF) &&
           dspic33ak_uart_reg_is_set(r->STAT, DSPIC33AK_UART_STAT_TXBE);
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_write_byte                                                  */
/* -------------------------------------------------------------------------- */
dspic33ak_uart_status_t dspic33ak_uart_write_byte(
    dspic33ak_uart_instance_t inst,
    uint8_t data)
{
    const dspic33ak_uart_regs_t *r;
    dspic33ak_uart_status_t st;
    uint32_t start_ms;

    st = uart_require_initialized(inst, &r);
    if (st != DSPIC33AK_UART_OK) {
        return st;
    }

    start_ms = uart_timeout_start_ms(inst);
    while (dspic33ak_uart_reg_is_set(r->STAT, DSPIC33AK_UART_STAT_TXBF)) {
        if (uart_timeout_enabled(inst) && uart_timeout_expired(inst, start_ms)) {
            return DSPIC33AK_UART_ERR_TIMEOUT;
        }
    }

    *r->TXB = (uint32_t)data;
    return DSPIC33AK_UART_OK;
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_read_byte                                                   */
/* -------------------------------------------------------------------------- */
dspic33ak_uart_status_t dspic33ak_uart_read_byte(
    dspic33ak_uart_instance_t inst,
    uint8_t *data)
{
    const dspic33ak_uart_regs_t *r;
    dspic33ak_uart_status_t st;

    if (data == 0) {
        return DSPIC33AK_UART_ERR_INVALID_ARG;
    }

    st = uart_require_initialized(inst, &r);
    if (st != DSPIC33AK_UART_OK) {
        return st;
    }

    /* ISR ring backend: pop from the software ring (the ISR owns the FIFO). */
    if (g_rx_mode[inst] == DSPIC33AK_UART_RX_MODE_ISR_RING) {
        return dspic33ak_uart_rx_isr_read_byte(inst, data);
    }

    /* Polling backend: read directly from the RX FIFO. */
    if (dspic33ak_uart_reg_is_set(r->STAT, DSPIC33AK_UART_STAT_RXBE)) {
        return DSPIC33AK_UART_ERR_RX_EMPTY;
    }

    *data = (uint8_t)(*r->RXB);
    return DSPIC33AK_UART_OK;
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_write                                                       */
/* -------------------------------------------------------------------------- */
size_t dspic33ak_uart_write(
    dspic33ak_uart_instance_t inst,
    const void *data,
    size_t len)
{
    const uint8_t *p = (const uint8_t *)data;
    size_t i;

    if (len != 0u && data == 0) {
        return 0u;
    }

    if (uart_check_initialized(inst) != DSPIC33AK_UART_OK) {
        return 0u;
    }

    for (i = 0u; i < len; i++) {
        if (dspic33ak_uart_write_byte(inst, p[i]) != DSPIC33AK_UART_OK) {
            break;
        }
    }

    return i;
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_read                                                        */
/* -------------------------------------------------------------------------- */
size_t dspic33ak_uart_read(
    dspic33ak_uart_instance_t inst,
    void *data,
    size_t len)
{
    uint8_t *p = (uint8_t *)data;
    size_t i;

    if (len != 0u && data == 0) {
        return 0u;
    }

    if (uart_check_initialized(inst) != DSPIC33AK_UART_OK) {
        return 0u;
    }

    for (i = 0u; i < len; i++) {
        if (dspic33ak_uart_read_byte(inst, &p[i]) != DSPIC33AK_UART_OK) {
            break;
        }
    }

    return i;
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_rx_flush                                                    */
/* -------------------------------------------------------------------------- */
void dspic33ak_uart_rx_flush(dspic33ak_uart_instance_t inst)
{
    const dspic33ak_uart_regs_t *r;

    if (uart_require_initialized(inst, &r) != DSPIC33AK_UART_OK) {
        return;
    }

    /* ISR ring backend: flush the ring (it also drains the hardware FIFO). */
    if (g_rx_mode[inst] == DSPIC33AK_UART_RX_MODE_ISR_RING) {
        dspic33ak_uart_rx_isr_flush(inst);
        return;
    }

    /* Polling backend: drain the hardware RX FIFO and clear the overflow flag. */
    while (!dspic33ak_uart_reg_is_set(r->STAT, DSPIC33AK_UART_STAT_RXBE)) {
        (void)(*r->RXB);
    }

    if (dspic33ak_uart_reg_is_set(r->STAT, DSPIC33AK_UART_STAT_RXFOIF)) {
        dspic33ak_uart_reg_clear(r->STAT, DSPIC33AK_UART_STAT_RXFOIF);
    }
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_rx_status_get                                               */
/* -------------------------------------------------------------------------- */
dspic33ak_uart_status_t dspic33ak_uart_rx_status_get(
    dspic33ak_uart_instance_t inst,
    dspic33ak_uart_rx_status_t *status)
{
    dspic33ak_uart_status_t st;

    if (status == 0) {
        return DSPIC33AK_UART_ERR_INVALID_ARG;
    }

    st = uart_check_initialized(inst);
    if (st != DSPIC33AK_UART_OK) {
        return st;
    }

    memset(status, 0, sizeof(*status));
    status->rx_mode = g_rx_mode[inst];

    /* ISR ring backend: copy the ring counters. Polling backend keeps no
     * counters, so the zeroed snapshot above is the result. */
    if (g_rx_mode[inst] == DSPIC33AK_UART_RX_MODE_ISR_RING) {
        dspic33ak_uart_rx_isr_status_t isr_status;

        dspic33ak_uart_rx_isr_status_get(inst, &isr_status);

        status->rx_isr_count            = isr_status.rx_isr_count;
        status->rx_byte_count           = isr_status.rx_byte_count;
        status->rx_fifo_overflow_count  = isr_status.rx_fifo_overflow_count;
        status->framing_error_count     = isr_status.framing_error_count;
        status->parity_error_count      = isr_status.parity_error_count;
        status->autobaud_overflow_count = isr_status.autobaud_overflow_count;
        status->tx_collision_count      = isr_status.tx_collision_count;
        status->rx_ring_overflow_count  = isr_status.rx_ring_overflow_count;
        status->rx_max_drain_count      = isr_status.rx_max_drain_count;
    }

