sulaolab/dspic33ak-usart-cmsis-driver/src/hal_uart/dspic33ak_uart.c
    return DSPIC33AK_UART_OK;
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_rx_status_clear                                             */
/* -------------------------------------------------------------------------- */
dspic33ak_uart_status_t dspic33ak_uart_rx_status_clear(
    dspic33ak_uart_instance_t inst)
{
    dspic33ak_uart_status_t st;

    st = uart_check_initialized(inst);
    if (st != DSPIC33AK_UART_OK) {
        return st;
    }

    /* ISR ring backend: clear the ring counters. Polling backend has none. */
    if (g_rx_mode[inst] == DSPIC33AK_UART_RX_MODE_ISR_RING) {
        dspic33ak_uart_rx_isr_status_clear(inst);
    }

    return DSPIC33AK_UART_OK;
}

/* ========================================================================== */
/* Public Functions: Asynchronous Transfer Model                              */
/* ========================================================================== */

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_set_callback                                                */
/* -------------------------------------------------------------------------- */
dspic33ak_uart_status_t dspic33ak_uart_set_callback(
    dspic33ak_uart_instance_t inst,
    dspic33ak_uart_event_callback_t callback,
    void *user_data)
{
    if (!uart_inst_is_valid(inst)) {
        return DSPIC33AK_UART_ERR_INVALID_ARG;
    }
    if (!dspic33ak_uart_instance_is_present(inst)) {
        return DSPIC33AK_UART_ERR_NOT_PRESENT;
    }

    g_callback[inst]           = callback;
    g_callback_user_data[inst] = user_data;
    return DSPIC33AK_UART_OK;
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_tx_enable                                                   */
/* -------------------------------------------------------------------------- */
dspic33ak_uart_status_t dspic33ak_uart_tx_enable(
    dspic33ak_uart_instance_t inst,
    bool enable)
{
    const dspic33ak_uart_regs_t *r;
    dspic33ak_uart_status_t st;

    st = uart_require_initialized(inst, &r);
    if (st != DSPIC33AK_UART_OK) {
        return st;
    }

    /* Disabling TX under an active async transfer would strand it (no
     * SEND_COMPLETE); reject until the transfer finishes or is aborted. */
    if (!enable && g_tx_busy[inst]) {
        return DSPIC33AK_UART_ERR_BUSY;
    }

    if (enable) {
        dspic33ak_uart_reg_set(r->CON, DSPIC33AK_UART_CON_TXEN);
    } else {
        dspic33ak_uart_reg_clear(r->CON, DSPIC33AK_UART_CON_TXEN);
    }
    g_tx_enabled[inst] = enable;
    return DSPIC33AK_UART_OK;
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_rx_enable                                                   */
/* -------------------------------------------------------------------------- */
dspic33ak_uart_status_t dspic33ak_uart_rx_enable(
    dspic33ak_uart_instance_t inst,
    bool enable)
{
    const dspic33ak_uart_regs_t *r;
    dspic33ak_uart_status_t st;

    st = uart_require_initialized(inst, &r);
    if (st != DSPIC33AK_UART_OK) {
        return st;
    }

    /* Disabling RX under an active async transfer would strand it (no
     * RX_COMPLETE); reject until the transfer finishes or is aborted. */
    if (!enable && g_rx_busy[inst]) {
        return DSPIC33AK_UART_ERR_BUSY;
    }

    if (enable) {
        dspic33ak_uart_reg_set(r->CON, DSPIC33AK_UART_CON_RXEN);
    } else {
        dspic33ak_uart_reg_clear(r->CON, DSPIC33AK_UART_CON_RXEN);
    }
    g_rx_enabled[inst] = enable;
    return DSPIC33AK_UART_OK;
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_tx_is_enabled                                               */
/* -------------------------------------------------------------------------- */
bool dspic33ak_uart_tx_is_enabled(dspic33ak_uart_instance_t inst)
{
    if (uart_check_initialized(inst) != DSPIC33AK_UART_OK) {
        return false;
    }
    return g_tx_enabled[inst];
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_rx_is_enabled                                               */
/* -------------------------------------------------------------------------- */
bool dspic33ak_uart_rx_is_enabled(dspic33ak_uart_instance_t inst)
{
    if (uart_check_initialized(inst) != DSPIC33AK_UART_OK) {
        return false;
    }
    return g_rx_enabled[inst];
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_set_baudrate                                                */
/* -------------------------------------------------------------------------- */
dspic33ak_uart_status_t dspic33ak_uart_set_baudrate(
    dspic33ak_uart_instance_t inst,
    uint32_t uart_clk_hz,
    uint32_t baudrate)
{
    const dspic33ak_uart_regs_t *r;
    dspic33ak_uart_status_t st;
    uint32_t brg;

    st = uart_require_initialized(inst, &r);
    if (st != DSPIC33AK_UART_OK) {
        return st;
    }

    if (uart_clk_hz == 0u || baudrate == 0u) {
        return DSPIC33AK_UART_ERR_INVALID_ARG;
    }

    /* Never reconfigure the divisor under an active transfer or while a byte is
     * still being shifted out. */
    if (g_tx_busy[inst] || g_rx_busy[inst]) {
        return DSPIC33AK_UART_ERR_BUSY;
    }
    if (!dspic33ak_uart_reg_is_set(r->STAT, DSPIC33AK_UART_STAT_TXMTIF) ||
        !dspic33ak_uart_reg_is_set(r->STAT, DSPIC33AK_UART_STAT_TXBE)) {
        return DSPIC33AK_UART_ERR_BUSY;
    }

    brg = uart_calc_brg(uart_clk_hz, baudrate);
    if (brg == 0u) {
        return DSPIC33AK_UART_ERR_INVALID_ARG;
    }

    *r->BRG = brg;
    g_uart_clk_hz[inst] = uart_clk_hz;
    g_baudrate[inst]    = baudrate;
    return DSPIC33AK_UART_OK;
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_get_baudrate                                                */
/* -------------------------------------------------------------------------- */
uint32_t dspic33ak_uart_get_baudrate(dspic33ak_uart_instance_t inst)
{
    if (uart_check_initialized(inst) != DSPIC33AK_UART_OK) {
        return 0u;
    }
    return g_baudrate[inst];
}

