sulaolab/dspic33ak-usart-cmsis-driver/src/hal_uart/dspic33ak_uart.c
/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_tx_start                                                    */
/* -------------------------------------------------------------------------- */
dspic33ak_uart_status_t dspic33ak_uart_tx_start(
    dspic33ak_uart_instance_t inst,
    const uint8_t *data,
    size_t length)
{
    dspic33ak_uart_status_t st;

    st = uart_check_initialized(inst);
    if (st != DSPIC33AK_UART_OK) {
        return st;
    }
    if (data == 0 || length == 0u) {
        return DSPIC33AK_UART_ERR_INVALID_ARG;
    }
    if (g_tx_busy[inst]) {
        return DSPIC33AK_UART_ERR_BUSY;
    }
    /* Async TX needs TX enabled and a usable (non-zero) TX interrupt priority;
     * otherwise the transfer would never complete (no SEND_COMPLETE). Reject up
     * front instead of returning a "started" transfer that silently stalls. */
    if (!g_tx_enabled[inst]) {
        return DSPIC33AK_UART_ERR_UNSUPPORTED;
    }
    if (g_tx_irq_priority[inst] == 0u) {
        return DSPIC33AK_UART_ERR_UNSUPPORTED;
    }

    /* Publish the transfer descriptor before arming the interrupt. */
    g_tx_buf[inst]   = data;
    g_tx_len[inst]   = length;
    g_tx_count[inst] = 0u;
    g_tx_busy[inst]  = true;

    /* Arm the TX interrupt and software-trigger the first entry so the engine
     * starts even if no "FIFO has space" interrupt is latched yet. */
    (void)uart_tx_irq_clear_flag(inst);
    if (!uart_tx_irq_enable(inst, true)) {
        g_tx_busy[inst] = false;
        return DSPIC33AK_UART_ERR_UNSUPPORTED;
    }
    (void)uart_tx_irq_raise_flag(inst);

    return DSPIC33AK_UART_OK;
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_tx_abort                                                    */
/* -------------------------------------------------------------------------- */
dspic33ak_uart_status_t dspic33ak_uart_tx_abort(dspic33ak_uart_instance_t inst)
{
    dspic33ak_uart_status_t st;

    st = uart_check_initialized(inst);
    if (st != DSPIC33AK_UART_OK) {
        return st;
    }

    (void)uart_tx_irq_enable(inst, false);
    (void)uart_tx_irq_clear_flag(inst);
    g_tx_busy[inst] = false;
    return DSPIC33AK_UART_OK;
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_tx_count_get                                                */
/* -------------------------------------------------------------------------- */
size_t dspic33ak_uart_tx_count_get(dspic33ak_uart_instance_t inst)
{
    if (!uart_inst_is_valid(inst)) {
        return 0u;
    }
    return g_tx_count[inst];
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_tx_is_busy                                                  */
/* -------------------------------------------------------------------------- */
bool dspic33ak_uart_tx_is_busy(dspic33ak_uart_instance_t inst)
{
    if (!uart_inst_is_valid(inst)) {
        return false;
    }
    return g_tx_busy[inst];
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_rx_start                                                    */
/* -------------------------------------------------------------------------- */
dspic33ak_uart_status_t dspic33ak_uart_rx_start(
    dspic33ak_uart_instance_t inst,
    uint8_t *data,
    size_t length)
{
    dspic33ak_uart_status_t st;

    st = uart_check_initialized(inst);
    if (st != DSPIC33AK_UART_OK) {
        return st;
    }
    if (data == 0 || length == 0u) {
        return DSPIC33AK_UART_ERR_INVALID_ARG;
    }
    /* Async RX is fed from the RX ISR, which only runs in ISR ring mode. */
    if (g_rx_mode[inst] != DSPIC33AK_UART_RX_MODE_ISR_RING) {
        return DSPIC33AK_UART_ERR_UNSUPPORTED;
    }
    /* RX must be enabled, or no bytes will arrive and the transfer never
     * completes (no RX_COMPLETE). */
    if (!g_rx_enabled[inst]) {
        return DSPIC33AK_UART_ERR_UNSUPPORTED;
    }
    if (g_rx_busy[inst]) {
        return DSPIC33AK_UART_ERR_BUSY;
    }

    /* Publish the descriptor, then arm. The RX interrupt is already enabled by
     * the ISR ring backend; dspic33ak_uart_async_rx_feed() picks the bytes up as
     * soon as g_rx_busy becomes true. */
    g_rx_buf[inst]   = data;
    g_rx_len[inst]   = length;
    g_rx_count[inst] = 0u;
    g_rx_busy[inst]  = true;

    return DSPIC33AK_UART_OK;
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_rx_abort                                                    */
/* -------------------------------------------------------------------------- */
dspic33ak_uart_status_t dspic33ak_uart_rx_abort(dspic33ak_uart_instance_t inst)
{
    dspic33ak_uart_status_t st;

    st = uart_check_initialized(inst);
    if (st != DSPIC33AK_UART_OK) {
        return st;
    }

    /* Single volatile flag write; the RX ISR re-checks it before each store. */
    g_rx_busy[inst] = false;
    return DSPIC33AK_UART_OK;
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_rx_count_get                                                */
/* -------------------------------------------------------------------------- */
size_t dspic33ak_uart_rx_count_get(dspic33ak_uart_instance_t inst)
{
    if (!uart_inst_is_valid(inst)) {
        return 0u;
    }
    return g_rx_count[inst];
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_rx_is_busy                                                  */
/* -------------------------------------------------------------------------- */
bool dspic33ak_uart_rx_is_busy(dspic33ak_uart_instance_t inst)
{
    if (!uart_inst_is_valid(inst)) {
        return false;
    }
    return g_rx_busy[inst];
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_tx_irq_handler                                              */
/* -------------------------------------------------------------------------- */
void dspic33ak_uart_tx_irq_handler(dspic33ak_uart_instance_t inst)
{
    const dspic33ak_uart_regs_t *r;

    if (uart_get_regs(inst, &r) != DSPIC33AK_UART_OK) {
        return;
    }

    (void)uart_tx_irq_clear_flag(inst);

    /* Spurious / aborted: nothing to do but make sure the interrupt is off. */
    if (!g_tx_busy[inst]) {
        (void)uart_tx_irq_enable(inst, false);
        return;
    }

