sulaolab/dspic33ak-usart-cmsis-driver/src/hal_uart/dspic33ak_uart.c
    /* Push bytes while the TX FIFO can accept them and data remains. */
    while ((g_tx_count[inst] < g_tx_len[inst]) &&
           !dspic33ak_uart_reg_is_set(r->STAT, DSPIC33AK_UART_STAT_TXBF)) {
        *r->TXB = (uint32_t)g_tx_buf[inst][g_tx_count[inst]];
        g_tx_count[inst]++;
    }

    /* All bytes submitted to the FIFO: stop the interrupt and report complete.
     * This is the CMSIS SEND_COMPLETE sense ("driver accepted and submitted all
     * data"); physical shift-register-empty is still observable via
     * dspic33ak_uart_tx_done(). */
    if (g_tx_count[inst] >= g_tx_len[inst]) {
        (void)uart_tx_irq_enable(inst, false);
        g_tx_busy[inst] = false;
        uart_notify(inst, DSPIC33AK_UART_EVENT_SEND_COMPLETE);
    }
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_async_rx_feed (internal ISR hook)                           */
/* -------------------------------------------------------------------------- */
bool dspic33ak_uart_async_rx_feed(dspic33ak_uart_instance_t inst, uint8_t byte)
{
    if (!uart_inst_is_valid(inst) || !g_rx_busy[inst]) {
        return false;
    }

    g_rx_buf[inst][g_rx_count[inst]] = byte;
    g_rx_count[inst]++;

    if (g_rx_count[inst] >= g_rx_len[inst]) {
        g_rx_busy[inst] = false;
        uart_notify(inst, DSPIC33AK_UART_EVENT_RX_COMPLETE);
    }

    return true;
}

/* -------------------------------------------------------------------------- */
/* dspic33ak_uart_async_notify_events (internal ISR hook)                     */
/* -------------------------------------------------------------------------- */
void dspic33ak_uart_async_notify_events(
    dspic33ak_uart_instance_t inst,
    uint32_t events)
{
    if (!uart_inst_is_valid(inst) || events == 0u) {
        return;
    }
    uart_notify(inst, events);
}

/* ========================================================================== */
/* Local Functions                                                            */
/* ========================================================================== */

/* -------------------------------------------------------------------------- */
/* uart_inst_is_valid                                                         */
/* -------------------------------------------------------------------------- */
static bool uart_inst_is_valid(dspic33ak_uart_instance_t inst)
{
    return ((unsigned)inst < (unsigned)DSPIC33AK_UART_INST_COUNT);
}

/* -------------------------------------------------------------------------- */
/* uart_get_regs                                                              */
/* -------------------------------------------------------------------------- */
static dspic33ak_uart_status_t uart_get_regs(
    dspic33ak_uart_instance_t inst,
    const dspic33ak_uart_regs_t **regs)
{
    const dspic33ak_uart_device_t *dev;

    if (regs == 0) {
        return DSPIC33AK_UART_ERR_INVALID_ARG;
    }

    if (!uart_inst_is_valid(inst)) {
        return DSPIC33AK_UART_ERR_INVALID_ARG;
    }

    dev = dspic33ak_uart_get_device(inst);
    if (dev == 0) {
        return DSPIC33AK_UART_ERR_NOT_PRESENT;
    }

    *regs = &dev->regs;
    return DSPIC33AK_UART_OK;
}

/* -------------------------------------------------------------------------- */
/* uart_require_initialized                                                   */
/* -------------------------------------------------------------------------- */
static dspic33ak_uart_status_t uart_require_initialized(
    dspic33ak_uart_instance_t inst,
    const dspic33ak_uart_regs_t **regs)
{
    dspic33ak_uart_status_t st;

    if (!uart_inst_is_valid(inst)) {
        return DSPIC33AK_UART_ERR_INVALID_ARG;
    }

    st = uart_get_regs(inst, regs);
    if (st != DSPIC33AK_UART_OK) {
        return st;
    }

    if (!g_initialized[inst]) {
        return DSPIC33AK_UART_ERR_NOT_INITIALIZED;
    }

    return DSPIC33AK_UART_OK;
}

/* -------------------------------------------------------------------------- */
/* uart_check_initialized                                                     */
/* -------------------------------------------------------------------------- */
static dspic33ak_uart_status_t uart_check_initialized(
    dspic33ak_uart_instance_t inst)
{
    const dspic33ak_uart_regs_t *r;
    return uart_require_initialized(inst, &r);
}

/* -------------------------------------------------------------------------- */
/* uart_calc_brg                                                              */
/* -------------------------------------------------------------------------- */
static uint32_t uart_calc_brg(
    uint32_t uart_clk_hz,
    uint32_t baudrate)
{
    uint64_t div;

    if (baudrate == 0u) {
        return 0u;
    }

    /*
     * Fractional mode: BRG = round(uart_clk_hz / baudrate) - 1.
     * 64-bit math avoids overflow on faster clocks.
     */
    div = ((uint64_t)uart_clk_hz + ((uint64_t)baudrate / 2u)) /
          (uint64_t)baudrate;
    if (div == 0u) {
        return 0u;
    }

    return (uint32_t)(div - 1u);
}

/* -------------------------------------------------------------------------- */
/* uart_timeout_enabled                                                       */
/* -------------------------------------------------------------------------- */
static bool uart_timeout_enabled(dspic33ak_uart_instance_t inst)
{
    return uart_inst_is_valid(inst) &&
           (g_get_ms[inst] != 0) &&
           (g_timeout_ms[inst] != 0u);
}

/* -------------------------------------------------------------------------- */
/* uart_timeout_start_ms                                                      */
/* -------------------------------------------------------------------------- */
static uint32_t uart_timeout_start_ms(dspic33ak_uart_instance_t inst)
{
    if (!uart_timeout_enabled(inst)) {
        return 0u;
    }

    return g_get_ms[inst]();
}

/* -------------------------------------------------------------------------- */
/* uart_timeout_expired                                                       */
/* -------------------------------------------------------------------------- */
static bool uart_timeout_expired(
    dspic33ak_uart_instance_t inst,
    uint32_t start_ms)
{
    uint32_t now;

    if (!uart_timeout_enabled(inst)) {
        return false;
    }

    now = g_get_ms[inst]();
    return ((uint32_t)(now - start_ms) >= g_timeout_ms[inst]);
}

