sulaolab/dspic33ak-usart-cmsis-driver/src/hal_uart/dspic33ak_uart.c
/* -------------------------------------------------------------------------- */
/* uart_async_reset                                                           */
/* -------------------------------------------------------------------------- */
static void uart_async_reset(dspic33ak_uart_instance_t inst)
{
    g_tx_buf[inst]   = 0;
    g_tx_len[inst]   = 0u;
    g_tx_count[inst] = 0u;
    g_tx_busy[inst]  = false;

    g_rx_buf[inst]   = 0;
    g_rx_len[inst]   = 0u;
    g_rx_count[inst] = 0u;
    g_rx_busy[inst]  = false;
}

/* -------------------------------------------------------------------------- */
/* uart_notify                                                                */
/* -------------------------------------------------------------------------- */
static void uart_notify(dspic33ak_uart_instance_t inst, uint32_t events)
{
    dspic33ak_uart_event_callback_t cb = g_callback[inst];

    if (cb != 0) {
        cb(inst, events, g_callback_user_data[inst]);
    }
}

/* ========================================================================== */
/* Local Functions: TX interrupt Flag / Enable / Priority                     */
/*                                                                            */
/* The TX interrupt bits live in scattered CPU registers and do not index by   */
/* instance, so the per-instance mapping is isolated here, mirroring the RX     */
/* interrupt helpers in dspic33ak_uart_rx_isr_ring.c. Each helper returns false */
/* when the instance has no TX interrupt mapping on this device (UART2/3/4      */
/* cases are compiled in only when the corresponding _UxTXIF macro exists).     */
/* ========================================================================== */

/* -------------------------------------------------------------------------- */
/* uart_tx_irq_set_priority                                                   */
/* -------------------------------------------------------------------------- */
static bool uart_tx_irq_set_priority(dspic33ak_uart_instance_t inst, uint8_t prio)
{
    switch (inst) {
#if defined(_U1TXIF)
    case DSPIC33AK_UART_INST_1: _U1TXIP = prio; return true;
#endif
#if defined(_U2TXIF)
    case DSPIC33AK_UART_INST_2: _U2TXIP = prio; return true;
#endif
#if defined(_U3TXIF)
    case DSPIC33AK_UART_INST_3: _U3TXIP = prio; return true;
#endif
#if defined(_U4TXIF)
    case DSPIC33AK_UART_INST_4: _U4TXIP = prio; return true;
#endif
    default: break;
    }
    return false;
}

/* -------------------------------------------------------------------------- */
/* uart_tx_irq_clear_flag                                                      */
/* -------------------------------------------------------------------------- */
static bool uart_tx_irq_clear_flag(dspic33ak_uart_instance_t inst)
{
    switch (inst) {
#if defined(_U1TXIF)
    case DSPIC33AK_UART_INST_1: _U1TXIF = 0; return true;
#endif
#if defined(_U2TXIF)
    case DSPIC33AK_UART_INST_2: _U2TXIF = 0; return true;
#endif
#if defined(_U3TXIF)
    case DSPIC33AK_UART_INST_3: _U3TXIF = 0; return true;
#endif
#if defined(_U4TXIF)
    case DSPIC33AK_UART_INST_4: _U4TXIF = 0; return true;
#endif
    default: break;
    }
    return false;
}

/* -------------------------------------------------------------------------- */
/* uart_tx_irq_raise_flag                                                      */
/*                                                                            */
/* Software-set the TX interrupt flag to force the first ISR entry after the   */
/* engine is armed (the FIFO-space condition may not latch a flag on enable).  */
/* -------------------------------------------------------------------------- */
static bool uart_tx_irq_raise_flag(dspic33ak_uart_instance_t inst)
{
    switch (inst) {
#if defined(_U1TXIF)
    case DSPIC33AK_UART_INST_1: _U1TXIF = 1; return true;
#endif
#if defined(_U2TXIF)
    case DSPIC33AK_UART_INST_2: _U2TXIF = 1; return true;
#endif
#if defined(_U3TXIF)
    case DSPIC33AK_UART_INST_3: _U3TXIF = 1; return true;
#endif
#if defined(_U4TXIF)
    case DSPIC33AK_UART_INST_4: _U4TXIF = 1; return true;
#endif
    default: break;
    }
    return false;
}

/* -------------------------------------------------------------------------- */
/* uart_tx_irq_enable                                                         */
/* -------------------------------------------------------------------------- */
static bool uart_tx_irq_enable(dspic33ak_uart_instance_t inst, bool enable)
{
    const uint8_t v = enable ? 1u : 0u;

    switch (inst) {
#if defined(_U1TXIF)
    case DSPIC33AK_UART_INST_1: _U1TXIE = v; return true;
#endif
#if defined(_U2TXIF)
    case DSPIC33AK_UART_INST_2: _U2TXIE = v; return true;
#endif
#if defined(_U3TXIF)
    case DSPIC33AK_UART_INST_3: _U3TXIE = v; return true;
#endif
#if defined(_U4TXIF)
    case DSPIC33AK_UART_INST_4: _U4TXIE = v; return true;
#endif
    default: break;
    }
    return false;
}
